recipe/test_case/system/controlDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;
startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         3000;
deltaT          1;
writeControl    timeStep;
writeInterval   3000;
purgeWrite      0;
writeFormat     ascii;
writePrecision  8;
writeCompression off;
timeFormat      general;
timePrecision   6;
runTimeModifiable false;

functions
{
    // Centre-line pressure over the developed region. The entrance length at
    // Re_Dh = 100 is about 6, so x in [9, 15] is fully developed.
    centreline
    {
        type            sets;
        libs            ("libsampling.so");
        writeControl    onEnd;
        interpolationScheme cellPoint;
        setFormat       raw;
        fields          (p);
        sets
        {
            line
            {
                type    uniform;
                axis    x;
                start   (9  0.5 0.5);
                end     (15 0.5 0.5);
                nPoints 31;
            }
        }
    }
}
